src/Documents/РасходнаяНакладная/РасходнаяНакладная.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РасходнаяНакладная</name>
  <registerRecords>InformationRegister.РасходТовара</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.СписокСотрудников</types>
    </type>
  </attributes>
  <tabularSections>
    <name>УходТовара</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.СписокТоваровИУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/РасходнаяНакладная/Forms/ФормаСписка/Module.bsl
&НаСервере
Процедура ИмпортxmlНаСервере(ПутьКФайлу)
    
    Попытка
        // Создаём чтение XML
        ЧтениеXML = Новый ЧтениеXML;
        ЧтениеXML.ОткрытьФайл(ПутьКФайлу);
        
        // Пропускаем объявление XML
        Пока ЧтениеXML.Прочитать() Цикл
            Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
                Прервать;
            КонецЕсли;
        КонецЦикла;
        
        // Проверяем корневой элемент
        Если ЧтениеXML.Имя <> "ДанныеОбмена" Тогда
            ВызватьИсключение "Неверный формат файла. Ожидался корневой элемент 'ДанныеОбмена'";
        КонецЕсли;
        
        // Пропускаем дату выгрузки
        Пока ЧтениеXML.Прочитать() Цикл
            Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента И ЧтениеXML.Имя = "РасходнаяНакладная" Тогда
                Прервать;
            КонецЕсли;
        КонецЦикла;
        
        // Получаем контрагента "Покупатель 1"
        КонтрагентПокупатель1 = Справочники.Контрагенты.НайтиПоНаименованию("Покупатель 1");
        
        // Получаем договор "Основной" для этого контрагента
        ДоговорОсновной = Справочники.Договоры.НайтиПоНаименованию("Основной", , КонтрагентПокупатель1);
        
        // Создаём один документ для всех данных
        НовыйДокумент = Документы.РасходнаяНакладная.СоздатьДокумент();
        НовыйДокумент.Дата = ТекущаяДата(); // Устанавливаем текущую дату или можно взять первую дату из XML
        НовыйДокумент.Контрагент = КонтрагентПокупатель1;
        НовыйДокумент.Договор = ДоговорОсновной;
        
        // Очищаем табличную часть
        НовыйДокумент.УходТовара.Очистить();
        
        // Соответствие для суммирования строк
        СтрокиТоваров = Новый Соответствие;
        
        КоличествоДокументов = 0;
        ПерваяДата = Неопределено;
        
        // Основной цикл чтения документа
        Пока Истина Цикл
            
            // Пропускаем до начала элемента РасходнаяНакладная
            Пока ЧтениеXML.ТипУзла <> ТипУзлаXML.НачалоЭлемента Или ЧтениеXML.Имя <> "РасходнаяНакладная" Цикл
                Если Не ЧтениеXML.Прочитать() Тогда
                    Прервать;
                КонецЕсли;
            КонецЦикла;
            
            Если ЧтениеXML.ТипУзла = ТипУзлаXML.КонецЭлемента И ЧтениеXML.Имя = "ДанныеОбмена" Тогда
                // Достигли конца корневого элемента
                Прервать;
            КонецЕсли;
            
            Если ЧтениеXML.ТипУзла <> ТипУзлаXML.НачалоЭлемента Тогда
                Прервать;
            КонецЕсли;
            
            // Читаем содержимое накладной
            Пока ЧтениеXML.Прочитать() Цикл
                
                Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
                    
                    Если ЧтениеXML.Имя = "Дата" Тогда
                        // Читаем дату документа (сохраняем первую дату)
                        Если ЧтениеXML.Прочитать() Тогда
                            Если ПерваяДата = Неопределено Тогда
                                ПерваяДата = Дата(ЧтениеXML.Значение);
                                НовыйДокумент.Дата = ПерваяДата;
                            КонецЕсли;
                        КонецЕсли;
                        
                    ИначеЕсли ЧтениеXML.Имя = "Запасы" Тогда
                        // Входим в элемент Запасы
                        
                    ИначеЕсли ЧтениеXML.Имя = "СтрокаТовара" Тогда
                        // Читаем строку товара
                        Номенклатура = Неопределено;
                        Количество = 0;
                        Цена = 0;
                        Сумма = 0;
                        
                        // Читаем элементы строки
                        Пока ЧтениеXML.Прочитать() Цикл
                            Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
                                
                                Если ЧтениеXML.Имя = "Номенклатура" Тогда
                                    Если ЧтениеXML.Прочитать() Тогда
                                        НаименованиеНоменклатуры = СокрЛП(ЧтениеXML.Значение);
                                        
                                        // Ищем номенклатуру по наименованию
                                        Номенклатура = Справочники.СписокТоваровИУслуг.НайтиПоНаименованию(НаименованиеНоменклатуры);
                                        
                                        Если Не ЗначениеЗаполнено(Номенклатура) Тогда
                                            // Создаем новую номенклатуру
                                            НовыйЭлемент = Справочники.СписокТоваровИУслуг.СоздатьЭлемент();
                                            НовыйЭлемент.Наименование = НаименованиеНоменклатуры;
                                            НовыйЭлемент.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Товар; // Укажите нужное значение
                                            НовыйЭлемент.ЕдиницаИзмерения = Справочники.ЕдиницыИзмерения.НайтиПоНаименованию("шт"); // Укажите нужную единицу
                                            НовыйЭлемент.Кладовщик = Справочники.СписокСотрудников.НайтиПоНаименованию("Митрофанов И.В");
                                            НовыйЭлемент.Записать();
                                            Номенклатура = НовыйЭлемент.Ссылка;
                                        КонецЕсли;
                                    КонецЕсли;
                                    
                                ИначеЕсли ЧтениеXML.Имя = "Количество" Тогда
                                    Если ЧтениеXML.Прочитать() Тогда
                                        Количество = Число(ЧтениеXML.Значение);
                                    КонецЕсли;
                                    
                                ИначеЕсли ЧтениеXML.Имя = "Цена" Тогда
                                    Если ЧтениеXML.Прочитать() Тогда
                                        Цена = Число(ЧтениеXML.Значение);
                                    КонецЕсли;
                                    
                                ИначеЕсли ЧтениеXML.Имя = "Сумма" Тогда
                                    Если ЧтениеXML.Прочитать() Тогда
                                        Сумма = Число(ЧтениеXML.Значение);
                                    КонецЕсли;
                                    
                                КонецЕсли;
                                
                            ИначеЕсли ЧтениеXML.ТипУзла = ТипУзлаXML.КонецЭлемента И ЧтениеXML.Имя = "СтрокаТовара" Тогда
                                Прервать;
                            КонецЕсли;
                        КонецЦикла;
                        
                        // Суммируем строки с одинаковой номенклатурой
                        Если ЗначениеЗаполнено(Номенклатура) Тогда
                            Если СтрокиТоваров[Номенклатура] = Неопределено Тогда
                                // Первое вхождение - сохраняем все данные
                                ДанныеСтроки = Новый Структура("Количество, Цена, Сумма", Количество, Цена, Сумма);
                                СтрокиТоваров.Вставить(Номенклатура, ДанныеСтроки);
                            Иначе
                                // Повторное вхождение - суммируем количество и сумму
                                СуществующиеДанные = СтрокиТоваров[Номенклатура];
                                СуществующиеДанные.Количество = СуществующиеДанные.Количество + Количество;
                                СуществующиеДанные.Сумма = СуществующиеДанные.Сумма + Сумма;
                                // Цену оставляем первую
                            КонецЕсли;
                        КонецЕсли;
                        
                    КонецЕсли;
                    
                ИначеЕсли ЧтениеXML.ТипУзла = ТипУзлаXML.КонецЭлемента И ЧтениеXML.Имя = "РасходнаяНакладная" Тогда
                    // Завершили чтение одной накладной
                    КоличествоДокументов = КоличествоДокументов + 1;
                    Прервать; // Выходим из внутреннего цикла чтения накладной
                КонецЕсли;
                
            КонецЦикла;
            
        КонецЦикла;
        
        ЧтениеXML.Закрыть();
        
        // Заполняем табличную часть документа из соответствия
        Если СтрокиТоваров.Количество() > 0 Тогда
            Для Каждого КлючИЗначение Из СтрокиТоваров Цикл
                Номенклатура = КлючИЗначение.Ключ;
                ДанныеСтроки = КлючИЗначение.Значение;
                
                НоваяСтрокаТЧ = НовыйДокумент.УходТовара.Добавить();
                НоваяСтрокаТЧ.Товар = Номенклатура;
                НоваяСтрокаТЧ.Количество = ДанныеСтроки.Количество;
                НоваяСтрокаТЧ.Цена = ДанныеСтроки.Цена;
                НоваяСтрокаТЧ.Сумма = ДанныеСтроки.Сумма;
            КонецЦикла;
            
            // Записываем и проводим документ
            Попытка
                
                НовыйДокумент.Записать(РежимЗаписиДокумента.Запись);
                Сообщить("Создан документ: Расходная накладная от " + Формат(НовыйДокумент.Дата, "ДЛФ=DD"));
                                
            Исключение
                Сообщить("Ошибка при записи документа: " + ОписаниеОшибки());
                
                // Альтернативный вариант - записать без проведения
                Попытка
                    НовыйДокумент.Записать(РежимЗаписиДокумента.Запись);
                    Сообщить("Документ записан без проведения из-за ошибки");
                Исключение
                    Сообщить("Критическая ошибка при записи документа: " + ОписаниеОшибки());
                КонецПопытки;
            КонецПопытки;
        Иначе
            Сообщить("Нет данных для создания документа");
        КонецЕсли;
        
        Сообщить("Импорт завершен. Обработано накладных в XML: " + КоличествоДокументов);
        
    Исключение
        Сообщение = Новый СообщениеПользователю;
        Сообщение.Текст = "Ошибка при импорте XML: " + ОписаниеОшибки();
        Сообщение.Сообщить();
    КонецПопытки;
    
КонецПроцедуры

&НаКлиенте
Процедура Импортxml(Команда)
	Режим = РежимДиалогаВыбораФайла.Открытие;
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
	ДиалогОткрытияФайла.ПолноеИмяФайла = "";
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ДиалогОткрытияФайла.Фильтр = "XML файлы(*.xml)|*.xml";
	ДиалогОткрытияФайла.Заголовок = "Выберите путь для XML";
    Если ДиалогОткрытияФайла.Выбрать() Тогда
		ПутьКФайлу = ДиалогОткрытияФайла.ПолноеИмяФайла;
	Иначе
		Текст = "Путь сохранения не выбран!";
		Предупреждение(Текст);
		Возврат;
	КонецЕсли;
	
	ПутьКФайлу = ДиалогОткрытияФайла.ПолноеИмяФайла;
	
	ИмпортxmlНаСервере(ПутьКФайлу);
	
	Элементы.Список.Обновить();
КонецПроцедуры
